{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Домашнее задание к лекции \"Функции\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "\n",
    "Исходные данные имеют следующую структуру:\n",
    "\n",
    "1. перечень всех документов\n",
    "```\n",
    "documents = [\n",
    "    {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    "    {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    "    {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "```\n",
    "2. перечень полок, на которых хранятся документы (если документ есть в documents, то он обязательно должен быть и в directories)\n",
    "```\n",
    "directories = {\n",
    "    '1': ['2207 876234', '11-2'],\n",
    "    '2': ['10006'],\n",
    "    '3': []\n",
    "}\n",
    "```\n",
    "\n",
    "Общие требования к программе:\n",
    "- код должен быть грамотно декомпозирован (каждая функция отвечает за свою конкретную задачу, дублирующийся функционал переиспользуется, а его код не повторяется);\n",
    "- в коде отсутствуют глобальные переменные (за исключением **documents** и **directories**);\n",
    "- пользовательский ввод обрабатывается в цикле **while** до тех пор, пока пользователь явно не завершит программу (вводом команды \"**q**\")."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите команду: p\n",
      "Введите номер документа: 10006\n",
      "Аристарх Павлов\n"
     ]
    }
   ],
   "source": [
    "documents = [\n",
    "    {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    "    {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    "    {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "\n",
    "directories = {\n",
    "    '1': ['2207 876234', '11-2'],\n",
    "    '2': ['10006'],\n",
    "    '3': []\n",
    "}\n",
    "\n",
    "\n",
    "#функция возвращает имя человека по номеру документа. команда p\n",
    "def name_by_number(input_number):\n",
    "    for line in documents:\n",
    "        if line['number'] == input_number:\n",
    "            print(line['name'])\n",
    "            return \n",
    "    print('Not found')\n",
    "    return\n",
    "                  \n",
    "\n",
    "#функция возвращает номер полки, на которой лежит документ с нужным номером/ команда s\n",
    "def shelf_by_number(input_number):\n",
    "    for key, value in directories.items():\n",
    "        for number in value:\n",
    "            if number == input_number:\n",
    "                print(key)\n",
    "                return\n",
    "    print('Not  found')\n",
    "    return 'Not found'\n",
    "\n",
    "#список всех документов по форме тип документа, номер, имя. команда l\n",
    "def list_of_docs():\n",
    "    for line in documents:\n",
    "        print(line['type'], line['number'], line['name'])\n",
    "    return\n",
    "\n",
    "#добавление новой полки. команда as\n",
    "def add_new_shelf(new_shelf):\n",
    "    for key in directories.keys():\n",
    "        if new_shelf == key:\n",
    "            print('Полка с таким номером уже существует')\n",
    "            return\n",
    "    directories [new_shelf] = []\n",
    "    print(directories)\n",
    "    return  \n",
    "\n",
    "#удаление документа из каталога и перечня полок. команда d\n",
    "def del_by_number(input_number):\n",
    "    x = shelf_by_number(input_number)\n",
    "    for line in documents:\n",
    "        if line['number'] == input_number:\n",
    "            documents.remove(line)\n",
    "            directories[x].remove(input_number)\n",
    "            print(documents, directories)\n",
    "            return\n",
    "    print('Not found')\n",
    "    return \n",
    "    \n",
    "#по номеру документа переносим документ с текущей полки на заданную полку. команда m\n",
    "def move_by_number(input_number, input_shelf):  \n",
    "    present_shelf = shelf_by_number(input_number)\n",
    "    if present_shelf == 'Not found':\n",
    "        print ('Doc number not found')\n",
    "        return\n",
    "    if input_shelf not in directories:\n",
    "        print ('Shelf not found')\n",
    "        return\n",
    "    directories[present_shelf].remove(input_number)\n",
    "    directories[input_shelf].append(input_number)\n",
    "    print(directories)\n",
    "    return\n",
    "    \n",
    "#добавить новый документ. команда a\n",
    "def add_new_doc(input_type, input_number, input_name, input_shelf):\n",
    "    documents.append({'type': input_type, 'number': input_number, 'name': input_name})\n",
    "    if input_shelf not in directories:\n",
    "        print ('Shelf not found')\n",
    "        return\n",
    "    directories[input_shelf].append(input_number)\n",
    "    print(documents, directories)\n",
    "\n",
    "#запрос команд\n",
    "usertask = input('Введите команду: ')\n",
    "if usertask == 'p':\n",
    "    input_number = input('Введите номер документа: ')\n",
    "    name_by_number(input_number)\n",
    "elif usertask == 's':\n",
    "    input_number = input('Введите номер документа: ')\n",
    "    shelf_by_number(input_number)\n",
    "elif usertask == 'l':\n",
    "    list_of_docs()\n",
    "elif usertask == 'as':\n",
    "    new_shelf = input('Введите номер новой полки: ')\n",
    "    add_new_shelf(new_shelf)\n",
    "elif usertask == 'd':\n",
    "    input_number = input('Введите номер документа: ')\n",
    "    del_by_number(input_number)\n",
    "elif usertask == 'm':\n",
    "    input_number = input('Введите номер документа: ')\n",
    "    input_shelf = input('Введите номер целевой полки: ')\n",
    "    move_by_number(input_number, input_shelf)\n",
    "elif usertask == 'a':\n",
    "    input_type = input('Введите тип документа: ')\n",
    "    input_number = input('Введите номер документа: ')\n",
    "    input_name = input('Введите имя человек: ')\n",
    "    input_shelf = input('Введите номер полки: ')\n",
    "    add_new_doc(input_type, input_number, input_name, input_shelf)\n",
    "else:\n",
    "    print('Некорректная команда')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
